{
  "questions": {
    "what is the school's mission statement?": "The school's mission is to provide a nurturing environment that promotes academic excellence and character development.",
    "how diverse is the student body?": "Our student body is highly diverse, representing various cultures and backgrounds.",
    "what foreign languages are offered?": "The school offers courses in Spanish, French, and Mandarin.",
    "how often are parent-teacher conferences held?": "Parent-teacher conferences are held twice a year to discuss students' progress and address any concerns.",
    "are there opportunities for student leadership?": "Yes, students have the opportunity to participate in various leadership roles, including student council and club leadership positions.",
    "what technology resources are available for students?": "The school provides modern technology resources, including computer labs, tablets, and access to online learning platforms.",
    "how is bullying addressed at the school?": "Bullying is taken seriously, and the school has a comprehensive anti-bullying policy in place. Students are encouraged to report any incidents, and there are support systems in place for victims.",
    "are there academic support services for students with learning differences?": "Yes, the school offers academic support services, including special education programs and tutoring, to cater to students with various learning needs.",
    "what is the school's approach to discipline?": "The school follows a positive discipline approach, emphasizing communication, problem-solving, and character development to address behavioral issues.",
    "how does the school involve parents in the learning process?": "Parents are actively involved in their child's education through regular communication, parent-teacher meetings, and involvement in school events and committees.",
    "what college acceptance rate does the school have?": "The school boasts a high college acceptance rate, with a significant number of graduates attending top-tier universities.",
    "what arts programs are available?": "The school offers a vibrant arts program, including visual arts, music, theater, and dance.",
    "can students bring their own devices to school?": "Yes, students are allowed to bring their own devices to school, subject to the school's technology policy.",
    "how is the school preparing students for the future workforce?": "The school focuses on developing critical thinking, communication, and collaboration skills to prepare students for success in the future workforce.",
    "what is the school's stance on community service?": "Community service is encouraged, and the school actively promotes and recognizes student involvement in community service projects.",
    "is there a school nurse on campus?": "Yes, there is a school nurse on campus to provide basic healthcare services and respond to medical emergencies.",
    "what technology is used in the classrooms for teaching?": "Classrooms are equipped with interactive whiteboards, projectors, and other modern technology to enhance the teaching and learning experience.",
    "how are teachers selected and trained?": "Teachers undergo a rigorous selection process based on their qualifications and experience. Professional development opportunities are provided to ensure continuous improvement.",
    "what is the school's policy on student attendance?": "Regular attendance is emphasized, and the school has policies in place to address absenteeism. Parents are encouraged to communicate with the school regarding any attendance concerns.",
    "how does the school celebrate cultural diversity?": "The school celebrates cultural diversity through events, festivals, and educational programs that highlight and embrace the different cultures represented within the school community.",
    "what resources are available for students with special talents or giftedness?": "Special programs and resources are provided for students with special talents or giftedness, including differentiated instruction and opportunities for advanced coursework.",
    "are there opportunities for students to participate in research projects?": "Yes, students have opportunities to engage in research projects, particularly in the science and humanities departments.",
    "how does the school address environmental sustainability?": "The school is committed to environmental sustainability and has implemented initiatives such as recycling programs, energy-efficient practices, and eco-friendly campus policies.",
    "what is the school's policy on cell phone use during school hours?": "The school has a cell phone use policy, which may vary by grade level. Students are expected to adhere to the policy during school hours.",
    "what language courses are offered besides the core curriculum?": "In addition to the core curriculum, the school offers language courses in German, Japanese, and Latin.",
    "how does the school support students with transitioning between grade levels?": "Transition support programs are in place to help students smoothly transition between grade levels, with orientations, mentorship programs, and guidance counseling.",
    "what is the school's stance on student privacy and data security?": "The school prioritizes student privacy and follows strict data security protocols to safeguard student information.",
    "how does the school address issues of bullying and peer conflict?": "The school has anti-bullying programs, counseling services, and conflict resolution strategies to address issues of bullying and peer conflict.",
    "what is the school's policy on social media use by students?": "The school provides guidelines on responsible social media use, educating students about the impact of their online presence and promoting digital citizenship.",
    "are there opportunities for students to participate in community outreach programs?": "Yes, the school encourages students to engage in community outreach programs and partners with local organizations for volunteer opportunities.",
    "how does the school incorporate technology into the curriculum?": "Technology is integrated into the curriculum through interactive lessons, online resources, and educational software to enhance the learning experience.",
    "what steps does the school take to ensure a safe and inclusive environment for all students?": "The school promotes inclusivity through awareness programs, diversity training, and policies that prohibit discrimination based on race, gender, or other factors.",
    "what is the school's approach to project-based learning?": "The school incorporates project-based learning into",
    "where is the school location": "",
    "where is the school": "",
    "where is the school located?": ""
  }
}